# Pandas

## Series

#### Importing libraries

In [1]:
import numpy as np
import pandas as pd

#### Creating series from various object types - list, array, dictionary

In [2]:
headings = ['a', 'b', 'c']
list1 = [11,22,33]
arr1 = np.array(list1)
dict1 = {'a':11, 'b':22, 'c':33}

In [3]:
headings

['a', 'b', 'c']

In [4]:
list1

[11, 22, 33]

In [5]:
arr1

array([11, 22, 33])

In [6]:
dict1

{'a': 11, 'b': 22, 'c': 33}

#### Passing the data argument when creating series

In [7]:
pd.Series(data = list1)

0    11
1    22
2    33
dtype: int64

In [9]:
pd.Series(arr1)

0    11
1    22
2    33
dtype: int32

In [11]:
pd.Series(dict1)

a    11
b    22
c    33
dtype: int64

In [12]:
pd.Series(headings)

0    a
1    b
2    c
dtype: object

#### Passing the index values for customising.

In [8]:
pd.Series(data = list1, index = headings)

a    11
b    22
c    33
dtype: int64

#### Obtaining information from series.

In [13]:
series1 = pd.Series(dict1)

In [14]:
series1

a    11
b    22
c    33
dtype: int64

In [15]:
series1['a']

11

#### Operations on series

In [16]:
dict2 = {'a':1, 'b':2, 'd':3}

In [17]:
series2 = pd.Series(dict2)

In [18]:
series2

a    1
b    2
d    3
dtype: int64

In [19]:
series1

a    11
b    22
c    33
dtype: int64

Where there is a match, the operation is performed. When no match, null value is returned.

In [20]:
series1 + series2

a    12.0
b    24.0
c     NaN
d     NaN
dtype: float64

## DataFrames

#### Creating dataframe

In [3]:
from numpy.random import randn

The arguments passed are the values of the dataframe, the labels of the row and column. An important thing to note is that dataframes are built upon series. Below the columns 'y' and 'z' are series only which share the common index. And the rows are also series.

In [5]:
dataframe = pd.DataFrame(randn(3,2), ['a','b','c'], ['y', 'z'])

In [6]:
dataframe

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

In [9]:
type(dataframe)

pandas.core.frame.DataFrame

#### Obtaining information from the columns of dataframes using brackets and the SQL dot notation.

In [7]:
dataframe['z']

a   -0.492404
b   -0.585436
c   -0.892137
Name: z, dtype: float64

In [8]:
type(dataframe['z'])

pandas.core.series.Series

In [10]:
dataframe.z

a   -0.492404
b   -0.585436
c   -0.892137
Name: z, dtype: float64

In [11]:
dataframe[['y','z']]

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

#### Creating a new column.

In [12]:
dataframe['new_col'] = dataframe['y'] - dataframe['z']

In [13]:
dataframe

          y         z   new_col
a  0.079911 -0.492404  0.572315
b  0.561538 -0.585436  1.146974
c -0.557171 -0.892137  0.334966

#### Dropping columns.

The axis has is an argument of the drop method which is zero by default. To drop a column, the axis value should be 1.

In [15]:
dataframe.drop('new_col', axis = 1)

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

But this drop method is not inplace. That means the drop is not permanent. If the dataframe is printed again then the dropped column will be seen.

In [16]:
dataframe

          y         z   new_col
a  0.079911 -0.492404  0.572315
b  0.561538 -0.585436  1.146974
c -0.557171 -0.892137  0.334966

To make it occur inplace, we mention the inplace argument as true.

In [17]:
dataframe.drop('new_col', axis = 1, inplace = True)

In [18]:
dataframe

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

#### Dropping rows.

In [19]:
dataframe.drop('c')

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436

#### Obtaining information from rows of the dataframe using loc and iloc.

loc is location and it obtains information of the row when the row name is passed. iloc is index based location where in the index of the row is passed. For example, here row 'c' has index value 2.

In [21]:
dataframe.loc['c']

y   -0.557171
z   -0.892137
Name: c, dtype: float64

In [22]:
type(dataframe.loc['c'])

pandas.core.series.Series

In [24]:
dataframe.iloc[2]

y   -0.557171
z   -0.892137
Name: c, dtype: float64

#### Obtaining information with combination of rows and columns.

In [25]:
dataframe.loc['a','z']

-0.4924042937068482

In [26]:
dataframe.loc[['b','c'],['y','z']]

          y         z
b  0.561538 -0.585436
c -0.557171 -0.892137

#### Obtaining information based on conditions.

In [28]:
bool_df = dataframe > 0

In [29]:
bool_df

       y      z
a   True  False
b   True  False
c  False  False

Shows null value where ever the condition is false.

In [30]:
dataframe[bool_df]

          y   z
a  0.079911 NaN
b  0.561538 NaN
c       NaN NaN

In [31]:
dataframe[dataframe<0]

          y         z
a       NaN -0.492404
b       NaN -0.585436
c -0.557171 -0.892137

In [32]:
dataframe['y'] > 0

a     True
b     True
c    False
Name: y, dtype: bool

Note that while grabbing rows, the null values are not shown. Since the values which satisfy the condition are only obtained.

In [33]:
dataframe[dataframe['y']>0]

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436

In [34]:
dataframe[dataframe['z']<0]['y']

a    0.079911
b    0.561538
c   -0.557171
Name: y, dtype: float64

Applying multiple conditions. Make sure that you use '&' instead of 'and' and '|' instead of 'or'. This is because the conditions compared are in the boolean form. 'and' and 'or' work only on single bollean values and not on series of boolean values.

In [36]:
dataframe[(dataframe['y']>0) & (dataframe['z']<0)]

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436

#### Dealing with indexes.

To reset the indexes or the row label, do the following. Again this does not occur inplace, so it has to be mentioned in the arguments.

In [37]:
dataframe

          y         z
a  0.079911 -0.492404
b  0.561538 -0.585436
c -0.557171 -0.892137

In [38]:
dataframe.reset_index()

  index         y         z
0     a  0.079911 -0.492404
1     b  0.561538 -0.585436
2     c -0.557171 -0.892137

To set index, we can create a new column and add it to the datafrme and then set it. Again the set index method is not inplace. It has to be mentioned explicitly.

In [39]:
new_index = 'aa bb cc'.split()

In [40]:
new_index

['aa', 'bb', 'cc']

In [42]:
dataframe['new_col'] = new_index

In [43]:
dataframe

          y         z new_col
a  0.079911 -0.492404      aa
b  0.561538 -0.585436      bb
c -0.557171 -0.892137      cc

In [44]:
dataframe.set_index('new_col')

                y         z
new_col
aa       0.079911 -0.492404
bb       0.561538 -0.585436
cc      -0.557171 -0.892137

#### Dealing with multi-level index.

We start off by creating the index levels by forming two lists, then zipping it into a tuple and then calling the pandas method which creates the multi-index.

In [45]:
list1 = ['a', 'a', 'a', 'b', 'b', 'b']
list2 = [11,22,33,11,22,33]

In [47]:
index_level = list(zip(list1,list2))
index_level

[('a', 11), ('a', 22), ('a', 33), ('b', 11), ('b', 22), ('b', 33)]

In [49]:
index_level = pd.MultiIndex.from_tuples(index_level)
index_level

MultiIndex([('a', 11),
            ('a', 22),
            ('a', 33),
            ('b', 11),
            ('b', 22),
            ('b', 33)],
           )

So as you can see, there is index 'a' and 'b' which has sub parts 11,22,33 and inside it are the values. This is the index hierarchy.

In [50]:
dataframe2 = pd.DataFrame(randn(6,2), index_level, ['Y','Z'])
dataframe2

             Y         Z
a 11  0.816788 -1.453178
  22  0.391026 -0.522579
  33  1.441272  1.962443
b 11 -1.015193 -0.186813
  22  0.161804  1.397325
  33 -1.915826  1.033368

In [51]:
dataframe2.loc['a']

           Y         Z
11  0.816788 -1.453178
22  0.391026 -0.522579
33  1.441272  1.962443

In [52]:
dataframe2.loc['a'].loc[22]

Y    0.391026
Z   -0.522579
Name: 22, dtype: float64

Naming the indexes.

In [53]:
dataframe2.index.names

FrozenList([None, None])

In [54]:
dataframe2.index.names = ['outside', 'inside']

In [55]:
dataframe2

                       Y         Z
outside inside
a       11      0.816788 -1.453178
        22      0.391026 -0.522579
        33      1.441272  1.962443
b       11     -1.015193 -0.186813
        22      0.161804  1.397325
        33     -1.915826  1.033368

Obtaining the cross-section in a multi-level indexed dataframe. When the index 'a' is called, it only results in displaying the part of 'a'.

In [60]:
dataframe2.xs('a')

               Y         Z
inside
11      0.816788 -1.453178
22      0.391026 -0.522579
33      1.441272  1.962443

In case you want the sub part '22' of both indexs 'a' and 'b', you do the following.

In [61]:
dataframe2.xs(22, level = 'inside')

                Y         Z
outside
a        0.391026 -0.522579
b        0.161804  1.397325

## Using Pandas to deal with missing data

To denote null values, use np.nan.

In [62]:
dataframe3 = {'x':[11,22,np.nan], 'y':[33, np.nan,np.nan], 'z':[44,55,66]}

In [65]:
df = pd.DataFrame(dataframe3)
df

      x     y   z
0  11.0  33.0  44
1  22.0   NaN  55
2   NaN   NaN  66

#### Dropping NaN values.

Now let's drop the missing values from the dataframe. It drops the rows with missing values since the default argument axis= 0.

In [66]:
df.dropna()

      x     y   z
0  11.0  33.0  44

If you want to drop columns where there are null values, mention axis = 1.

In [68]:
df.dropna(axis=1)

    z
0  44
1  55
2  66

There is another argument called thresh which takes in integer value. The integer value denotes the threshold for how many minimum non-Nan values should be present. So as you can see, the second row is retained since it has 2 non-Nan values when 2 is given as the value of thresh.

In [70]:
df.dropna(thresh=2)

      x     y   z
0  11.0  33.0  44
1  22.0   NaN  55

#### Filling NaN values.

In [71]:
df.fillna(value='A values if filled')

                    x                   y   z
0                  11                  33  44
1                  22  A values if filled  55
2  A values if filled  A values if filled  66

Usually the mean is filled in place of NaN values.

In [73]:
df['x'].fillna(value=df['x'].mean())

0    11.0
1    22.0
2    16.5
Name: x, dtype: float64

## Using Pandas to group data

Creating a dataframe for grouping.

In [2]:
data = {'Department':['COMP', 'COMP', 'IT', 'IT', 'ELEC', 'ELEC'],
        'Name':['Jay', 'Mini', 'Sam', 'Jack', 'Kev', 'Russ'],
        'Scores':[111,222,333,444,555,666]}

In [3]:
dataframe4 = pd.DataFrame(data)

In [4]:
dataframe4

  Department  Name  Scores
0       COMP   Jay     111
1       COMP  Mini     222
2         IT   Sam     333
3         IT  Jack     444
4       ELEC   Kev     555
5       ELEC  Russ     666

Grouping by the department name.

In [5]:
dataframe4.groupby('Department')

It return the address. So to view it, store in a variable.

In [6]:
Dept = dataframe4.groupby('Department')

Now performing some functions, like getting the mean score or sum according to the department groups. Pandas automatically consider the numeric column since operations cannot be performed on strings.

In [7]:
Dept.mean()

            Scores
Department
COMP         166.5
ELEC         610.5
IT           388.5

In [8]:
Dept.sum()

            Scores
Department
COMP           333
ELEC          1221
IT             777

In [9]:
Dept.std()

               Scores
Department
COMP        78.488853
ELEC        78.488853
IT          78.488853

In [10]:
Dept.std().loc['IT']

Scores    78.488853
Name: IT, dtype: float64

For counting the number of instances.

In [11]:
Dept.count()

            Name  Scores
Department
COMP           2       2
ELEC           2       2
IT             2       2

In [12]:
Dept.max()

            Name  Scores
Department
COMP        Mini     222
ELEC        Russ     666
IT           Sam     444

In [13]:
Dept.describe()

           Scores
            count   mean        std    min     25%    50%     75%    max
Department
COMP          2.0  166.5  78.488853  111.0  138.75  166.5  194.25  222.0
ELEC          2.0  610.5  78.488853  555.0  582.75  610.5  638.25  666.0
IT            2.0  388.5  78.488853  333.0  360.75  388.5  416.25  444.0

## Using Pandas to combine dataframes

#### Using concatenation.
It takes the dataframes and glues or sticks them together. It is important that the dimension match along the axis while concatenating.

Creating dataframes.

In [15]:
df1 = pd.DataFrame({'A':['a0','a1','a2','a3'], 'B':['b0','b1','b2','b3'],
                    'C':['c0','c1','c2','c3'], 'D':['d0','d1','d2','d3']},
                     index=[0,1,2,3])

In [16]:
df2 = pd.DataFrame({'A':['a4','a5','a6','a7'], 'B':['b4','b5','b6','b7'],
                    'C':['c4','c5','c6','c7'], 'D':['d4','d5','d6','d7']},
                     index=[4,5,6,7])

In [18]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [19]:
df2

    A   B   C   D
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7

In [23]:
pd.concat([df1,df2])

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7

When concatenating along columns, use axis = 1. 'Nan' is filled where the data is missing.

In [24]:
pd.concat([df1,df2], axis=1)

     A    B    C    D    A    B    C    D
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN  NaN   a5   b5   c5   d5
6  NaN  NaN  NaN  NaN   a6   b6   c6   d6
7  NaN  NaN  NaN  NaN   a7   b7   c7   d7

#### Using merge.
Just like the merge function of SQL tables, this merge function also allows dataframes to be merged.

Creating dataframes where there is one column common.

In [28]:
df4 = pd.DataFrame({'value':['v0','v1','v2','v3'],
                    'a':['a0','a1','a2','a3'],
                    'b':['b0','b1','b2','b3']})

In [27]:
df5 = pd.DataFrame({'value':['v0','v1','v2','v3'],
                    'c':['c0','c1','c2','c3'],
                    'd':['d0','d1','d2','d3']})

In [29]:
df4

  value   a   b
0    v0  a0  b0
1    v1  a1  b1
2    v2  a2  b2
3    v3  a3  b3

In [30]:
df5

  value   c   d
0    v0  c0  d0
1    v1  c1  d1
2    v2  c2  d2
3    v3  c3  d3

In [31]:
pd.merge(df4,df5,how='inner',on='value')

  value   a   b   c   d
0    v0  a0  b0  c0  d0
1    v1  a1  b1  c1  d1
2    v2  a2  b2  c2  d2
3    v3  a3  b3  c3  d3

It performs an inner join on the common column 'value'. The inner join is the default join. The other joins are outer join, right join and left join.

#### Using joining.
When there are dataframes with columns of different indexes then they can be merged into a single dataframe using join.

In [33]:
df6 = pd.DataFrame({'a':['a0','a1','a2'],
                    'b':['b0','b1','b2']}, 
                     index=[0,1,2])

df7 = pd.DataFrame({'c':['c0','c2','c3'],
                    'd':['d0','d2','d3']}, 
                    index=[0,2,3])

In [36]:
df6

    a   b
0  a0  b0
1  a1  b1
2  a2  b2

In [37]:
df7

    c   d
0  c0  d0
2  c2  d2
3  c3  d3

In [34]:
df6.join(df7)

    a   b    c    d
0  a0  b0   c0   d0
1  a1  b1  NaN  NaN
2  a2  b2   c2   d2

In [35]:
df7.join(df6)

    c   d    a    b
0  c0  d0   a0   b0
2  c2  d2   a2   b2
3  c3  d3  NaN  NaN

## Carry out different operations on Pandas dataframe

In [5]:
df8 = pd.DataFrame({'a':[11,22,33,22],
                    'b':[1,2,3,4], 
                     'c':['aa','bb','cc','dd']})

In [6]:
df8

    a  b   c
0  11  1  aa
1  22  2  bb
2  33  3  cc
3  22  4  dd

#### Getting unique values and number of unique values.

In [7]:
df8['a'].unique()

array([11, 22, 33], dtype=int64)

In [8]:
df8['a'].nunique()

3

In [9]:
df8['a'].value_counts()

22    2
11    1
33    1
Name: a, dtype: int64

#### Applying inbuilt and custom functions to a dataframe.

In [10]:
def func(x):
    return x+x

In [11]:
df8['b'].apply(func)

0    2
1    4
2    6
3    8
Name: b, dtype: int64

In [13]:
df8['c'].apply(len)

0    2
1    2
2    2
3    2
Name: c, dtype: int64

In [14]:
df8['a'].apply(lambda x: x*x)

0     121
1     484
2    1089
3     484
Name: a, dtype: int64

#### To get column names and information about index.

In [15]:
df8.columns

Index(['a', 'b', 'c'], dtype='object')

In [16]:
df8.index

RangeIndex(start=0, stop=4, step=1)

#### Sorting according to a column.

In [17]:
df8.sort_values('a')

    a  b   c
0  11  1  aa
1  22  2  bb
3  22  4  dd
2  33  3  cc

#### Finding null values.

In [18]:
df8.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [19]:
df8.isnull().sum()

a    0
b    0
c    0
dtype: int64

#### Creating pivot table.
Method pivot_table() takes 3 main arguments: values, index, columns.

In [20]:
df9 = pd.DataFrame({'a':['jam','jam','jam','milk','milk','milk'],
                    'b':['red','red','white','white','red','red'],
                    'c':['yes','no','yes','no','yes','no'],
                    'd':[11,33,22,55,44,11]})

In [21]:
df9

      a      b    c   d
0   jam    red  yes  11
1   jam    red   no  33
2   jam  white  yes  22
3  milk  white   no  55
4  milk    red  yes  44
5  milk    red   no  11

In [22]:
df9.pivot_table(values='d', index=['a','b'], columns='c')

c             no   yes
a    b
jam  red    33.0  11.0
     white   NaN  22.0
milk red    11.0  44.0
     white  55.0   NaN

## Reading and writing data using Pandas

#### Dealing with CSV files.
First reading the file, then displaying the dataframe followed by writing to the file.

In [31]:
df10 = pd.read_csv('data.csv')

In [32]:
df10

     A         B
0  9.6  90509.76
1  8.4  42738.36
2  3.1  36000.00
3  4.6  86400.00

In [33]:
df10.to_csv('data_output')

In [34]:
pd.read_csv('data_output')

   Unnamed: 0    A         B
0           0  9.6  90509.76
1           1  8.4  42738.36
2           2  3.1  36000.00
3           3  4.6  86400.00

To avoid this unnamed index to form, set the argument index to false.

In [35]:
df10.to_csv('data_output',index=False)

In [36]:
pd.read_csv('data_output')

     A         B
0  9.6  90509.76
1  8.4  42738.36
2  3.1  36000.00
3  4.6  86400.00

#### Dealing with Excel files.

In [38]:
df11 = pd.read_excel('dataset.xlsx')

In [39]:
df11

                                             Heading  Value
0  8 Dead As Cyclone Fani Hits West Bengal To Con...      1
1  Cyclone Gaja To Cross Tamil Nadu Coast Shortly...      0
2  Cyclone Sagar Forms In Arabian Sea: Know About...      0
3  Tracing Cyclone Ockhi In India: All You Need T...      0
4  Mizoram Government Issues Warning Ahead Of Cyc...      1

In [40]:
df11.to_excel('dataset_output.xlsx',sheet_name='dataset sheet')

#### Dealing with HTML input.
Choose a webiste which has a table. Using Pandas the webpage will be read in the form of a list.

In [41]:
data = pd.read_html('https://en.wikipedia.org/wiki/List_of_languages_by_number_of_native_speakers')

In [43]:
type(data)

list

In [42]:
data[0]

,Rank,Language,Speakers(millions),% of World pop.(March 2019)[8],Language family,Branch
0,1,Mandarin Chinese,918.0,11.922,Sino-Tibetan,Sinitic
1,2,Spanish,480.0,5.994,Indo-European,Romance
2,3,English,379.0,4.922,Indo-European,Germanic
3,4,Hindi (Sanskritised Hindustani)[9],341.0,4.429,Indo-European,Indo-Aryan
4,5,Bengali,228.0,2.961,Indo-European,Indo-Aryan
...,...,...,...,...,...,...
86,87,Czech,10.7,0.139,Indo-European,Balto-Slavic
87,88,Taizzi-Adeni Arabic,10.5,0.136,Afroasiatic,Semitic
88,89,Uyghur,10.4,0.135,Turkic,Karluk
89,90,Min Dong Chinese,10.3,0.134,Sino-Tibetan,Sinitic
90,91,Sylheti,10.3,0.134,Indo-European,Indo-Aryan

#### Dealing with SQL database.
Remember that every SQL engine has a different way of dealing with it. Here a simple SQL database is made stored in the memory and Pandas will be used. The engine is created where the database is stored in memory. Then later a dataframe is written to SQL giving it a name and the engine. Then the SQL dataframe is read.

In [44]:
from sqlalchemy import create_engine

In [45]:
sql_engine = create_engine('sqlite:///:memory:')

In [47]:
df10.to_sql('sql_data',sql_engine)

In [48]:
sql_df = pd.read_sql('sql_data',sql_engine)

In [49]:
sql_df

   index    A         B
0      0  9.6  90509.76
1      1  8.4  42738.36
2      2  3.1  36000.00
3      3  4.6  86400.00